RT-Thread/rt-thread/bsp/stm32f10x/drivers/usb/inc/otgd_fs_regs.h
}
USB_OTG_dev_in_ep_regs;

/*******************************************************************************
 * dev Logical OUT Endpoint-Specific Registers Offsets: B00h-CFCh
 * There will be one set of endpoint registers per logical endpoint
 * implemented.
 * These registers are visible only in dev mode and must not be
 * accessed in Host mode, as the results are unknown
******************************************************************************/
typedef struct _USB_OTG_dev_out_ep_regs
{
  __IO uint32_t dev_out_ep_ctl;       /* dev OUT Endpoint Control Reg  B00h + (ep_num * 20h) + 00h*/
  __IO uint32_t dev_out_ep_frm_nbr;   /* dev OUT Endpoint Frame number B00h + (ep_num * 20h) + 04h*/
  __IO uint32_t dev_out_ep_int;              /* dev OUT Endpoint Itr Reg      B00h + (ep_num * 20h) + 08h*/
  uint32_t reserved0C;                    /* Reserved                         B00h + (ep_num * 20h) + 0Ch*/
  __IO uint32_t dev_out_ep_txfer_siz; /* dev OUT Endpoint Txfer Size   B00h + (ep_num * 20h) + 10h*/
  __IO uint32_t dev_out_ep_dma;              /* dev OUT Endpoint DMA Address  B00h + (ep_num * 20h) + 14h*/
  uint32_t reserved18[2];                 /* Reserved B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch*/

}
USB_OTG_dev_out_ep_regs;
/*******************************************************************************
 * Host Mode Register Structures
 * The Host Global Registers structure defines the size and relative
 * field offsets for the Host Mode Global Registers.
 * Host Global Registers offsets 400h-7FFh.
*******************************************************************************/
typedef struct _USB_OTG_host_regs
{
  __IO uint32_t host_cfg;             /* Host Configuration Register    400h*/
  __IO uint32_t host_frm_intrvl;      /* Host Frame Interval Register   404h*/
  __IO uint32_t host_frm_nbr;         /* Host Frame Nbr/Frame Remaining 408h*/
  uint32_t reserved40C;                   /* Reserved                       40Ch*/
  __IO uint32_t host_p_tx_sts;   /* Host Periodic Tx FIFO/ Queue Status 410h*/
  __IO uint32_t host_all_int;   /* Host All Channels Interrupt Register 414h*/
  __IO uint32_t host_all_int_msk;   /* Host All Channels Interrupt Mask 418h*/

}
USB_OTG_host_regs;

/*******************************************************************************
* Host Channel Specific Registers 500h-5FCh
*******************************************************************************/
typedef struct _USB_OTG_hc_regs
{

  __IO uint32_t hc_char;
  __IO uint32_t hc_split;
  __IO uint32_t hc_int;
  __IO uint32_t hc_int_msk;
  __IO uint32_t hc_txfer_siz;
  __IO uint32_t hc_dma;
  uint32_t reserved[2];

}
USB_OTG_hc_regs;
/*******************************************************************************
 * otg Core registers .
 * The USB_OTG_core_regs structure defines the size
 * and relative field offsets for the Core Global registers.
 ******************************************************************************/
typedef struct USB_OTG_core_regs  //000h
{
  USB_OTG_common_regs         *common_regs;
  USB_OTG_dev_regs            *dev_regs;
  USB_OTG_host_regs           *host_regs;
  USB_OTG_dev_in_ep_regs      *inep_regs[MAX_EPS_CHANNELS];
  USB_OTG_dev_out_ep_regs     *outep_regs[MAX_EPS_CHANNELS];
  USB_OTG_hc_regs             *hc_regs[MAX_EPS_CHANNELS];
  __IO uint32_t                    *hprt0;
  __IO uint32_t                    *data_fifo[MAX_EPS_CHANNELS];
  __IO uint32_t                    *pcgcctl;

}
USB_OTG_CORE_REGS , *pUSB_OTG_CORE_REGS;
/******************************************************************************/

typedef union _USB_OTG_OTG_ctl_data
{
  uint32_t d32;
  struct
  {
uint32_t sesreqscs :
    1;
uint32_t sesreq :
    1;
uint32_t reserved2_7 :
    6;
uint32_t hstnegscs :
    1;
uint32_t hnpreq :
    1;
uint32_t hstsethnpen :
    1;
uint32_t devhnpen :
    1;
uint32_t reserved12_15 :
    4;
uint32_t conidsts :
    1;
uint32_t reserved17 :
    1;
uint32_t asesvld :
    1;
uint32_t bsesvld :
    1;
uint32_t currmod :
    1;
uint32_t reserved21_31 :
    11;
  }
  b;
} USB_OTG_OTG_ctl_data;

/******************************************************************************/

typedef union _USB_OTG_OTG_int_data
{
  uint32_t d32;
  struct
  {
uint32_t reserved0_1 :
    2;
uint32_t sesenddet :
    1;
uint32_t reserved3_7 :
    5;
uint32_t sesreqsucstschng :
    1;
uint32_t hstnegsucstschng :
    1;
uint32_t reserver10_16 :
    7;
uint32_t hstnegdet :
    1;
uint32_t adevtoutchng :
    1;
uint32_t debdone :
    1;
uint32_t reserved31_20 :
    12;
  }
  b;
} USB_OTG_OTG_int_data;


/******************************************************************************/


typedef union _USB_OTG_ahb_cfg_data
{
  uint32_t d32;
  struct
  {
uint32_t glblintrmsk :
    1;
uint32_t hburstlen :
    4;
uint32_t dmaenable :
    1;
uint32_t reserved :
    1;
uint32_t nptxfemplvl_txfemplvl :
    1;
uint32_t ptxfemplvl :
    1;
uint32_t reserved9_31 :
    23;
  }
  b;
} USB_OTG_ahb_cfg_data;

/******************************************************************************/

typedef union _USB_OTG_usb_cfg_data
{
  uint32_t d32;
  struct
  {
uint32_t toutcal :
    3;
uint32_t phyif :
    1;
uint32_t ulpi_utmi_sel :
    1;
uint32_t fsintf :
    1;
uint32_t physel :
    1;
uint32_t ddrsel :
    1;
uint32_t srpcap :
    1;
uint32_t hnpcap :
    1;
uint32_t usbtrdtim :
    4;
uint32_t nptxfrwnden :
    1;
uint32_t phylpwrclksel :
    1;
uint32_t otgutmifssel :
    1;
uint32_t ulpi_fsls :
    1;
uint32_t ulpi_auto_res :
    1;
uint32_t ulpi_clk_sus_m :
    1;
uint32_t ulpi_ext_vbus_drv :
    1;
uint32_t ulpi_int_vbus_indicator :
    1;
uint32_t term_sel_dl_pulse :
    1;
uint32_t reserved :
    6;
uint32_t force_host :
    1;
uint32_t force_dev :
    1;
uint32_t corrupt_tx :
    1;
  }
  b;
} USB_OTG_usb_cfg_data;
/******************************************************************************/

typedef union _USB_OTG_rst_ctl_data
{
  uint32_t d32;
  struct
  {
uint32_t csftrst :
    1;
uint32_t hsftrst :
    1;
uint32_t hstfrm :
    1;
uint32_t intknqflsh :
    1;
uint32_t rxfflsh :
    1;
uint32_t txfflsh :
    1;
uint32_t txfnum :
    5;
uint32_t reserved11_29 :
    19;
uint32_t dmareq :
    1;
uint32_t ahbidle :
    1;
  }
  b;
} USB_OTG_rst_ctl_data;

/******************************************************************************/

typedef union _USB_OTG_int_msk_data
{
  uint32_t d32;
  struct
  {
uint32_t reserved0 :
    1;
uint32_t modemismatch :
    1;
uint32_t otgintr :
    1;
uint32_t sofintr :
    1;
uint32_t rxstsqlvl :
    1;
uint32_t nptxfempty :
    1;
uint32_t ginnakeff :
    1;
uint32_t goutnakeff :
    1;
uint32_t reserved8 :
    1;
uint32_t i2cintr :
    1;
uint32_t erlysuspend :
    1;
uint32_t usbsuspend :
    1;
uint32_t usbreset :
    1;
uint32_t enumdone :
    1;
uint32_t isooutdrop :
    1;
uint32_t eopframe :
    1;
uint32_t reserved16 :
    1;
uint32_t epmismatch :
    1;
uint32_t inepintr :
    1;
uint32_t outepintr :
    1;
uint32_t incomplisoin :
    1;
uint32_t incomplisoout :
    1;
uint32_t reserved22_23 :
    2;
uint32_t portintr :
    1;
uint32_t hcintr :
    1;
uint32_t ptxfempty :
    1;
uint32_t reserved27 :
    1;
uint32_t conidstschng :
    1;
uint32_t disconnect :
    1;
uint32_t sessreqintr :
    1;
uint32_t wkupintr :
    1;
  }
  b;
} USB_OTG_int_msk_data;

/******************************************************************************/


typedef union _USB_OTG_int_sts_data
{
  uint32_t d32;
  struct
  {
uint32_t curmode :
    1;
uint32_t modemismatch :
    1;
uint32_t otgintr :
    1;
uint32_t sofintr :
    1;
uint32_t rxstsqlvl :
    1;
uint32_t nptxfempty :
    1;
uint32_t ginnakeff :
    1;
uint32_t goutnakeff :
    1;
uint32_t reserved8 :
    1;
uint32_t i2cintr :
    1;
uint32_t erlysuspend :
    1;
uint32_t usbsuspend :
    1;
uint32_t usbreset :
    1;
uint32_t enumdone :
    1;
uint32_t isooutdrop :
    1;
uint32_t eopframe :
    1;
uint32_t intokenrx :
    1;
uint32_t epmismatch :
    1;
uint32_t inepint:
    1;
uint32_t outepintr :
    1;
uint32_t incomplisoin :
    1;
uint32_t incomplisoout :
    1;
uint32_t reserved22_23 :
    2;
uint32_t portintr :
    1;
uint32_t hcintr :
    1;
uint32_t ptxfempty :
    1;
uint32_t reserved27 :
    1;
uint32_t conidstschng :
    1;
uint32_t disconnect :
    1;
uint32_t sessreqintr :
    1;
uint32_t wkupintr :
    1;
  }
  b;
} USB_OTG_int_sts_data;

/******************************************************************************/
typedef union _USB_OTG_dev_rx_sts_data
{

  uint32_t d32;
  struct
  {
uint32_t epnum :
    4;
uint32_t bcnt :
    11;
uint32_t dpid :
    2;
uint32_t pktsts :
    4;
uint32_t fn :
    4;
uint32_t reserved :
    7;
  }
  b;
} USB_OTG_dev_rx_sts_data;

/******************************************************************************/
typedef union _USB_OTG_host_rx_sts_data
{

  uint32_t d32;
  struct
  {
uint32_t chnum :
    4;
uint32_t bcnt :
    11;
uint32_t dpid :
    2;
uint32_t pktsts :
    4;
uint32_t reserved :
    11;
  }
  b;
} USB_OTG_host_rx_sts_data;

/******************************************************************************/

typedef union _USB_OTG_fifo_size_data
{
  uint32_t d32;
  struct
  {
uint32_t startaddr :
    16;
uint32_t depth :
    16;
  }
  b;
} USB_OTG_fifo_size_data;

/******************************************************************************/

typedef union _USB_OTG_np_tx_sts_data
{
  uint32_t d32;
  struct
  {
uint32_t nptxfspcavail :
    16;
uint32_t nptxqspcavail :
    8;
uint32_t nptxqtop_terminate :
    1;
uint32_t nptxqtop_token :
    2;
uint32_t nptxqtop_chnep :
    4;
uint32_t reserved :
    1;
  }
  b;
} USB_OTG_np_tx_sts_data;

/******************************************************************************/

typedef union _USB_OTG_dev_tx_fifo_sts_data
{
  uint32_t d32;
  struct
  {
uint32_t txfspcavail :
    16;
uint32_t reserved :
    16;
  }
  b;
} USB_OTG_dev_tx_fifo_sts_data;

/******************************************************************************/
typedef union _USB_OTG_i2c_ctl_data
{

  uint32_t d32;
  struct
  {
uint32_t rwdata :
    8;
uint32_t regaddr :
    8;
uint32_t addr :
    7;
uint32_t i2cen :
    1;
uint32_t ack :
    1;
uint32_t i2csuspctl :
    1;
uint32_t i2cdevaddr :
    2;
uint32_t dat_se0:
    1;
uint32_t reserved :
    1;
uint32_t rw :
    1;
uint32_t bsydne :
    1;
  }
  b;
} USB_OTG_i2c_ctl_data;

/******************************************************************************/

typedef union _USB_OTG_gpio_data
{

  uint32_t d32;
  struct
  {
    /* input */
uint32_t ovrcur :
    1;
uint32_t otgid :
    1;
uint32_t reserved_in :
    14;
    /* Output */
uint32_t pwdn :
    1;
uint32_t i2cifen :
    1;
uint32_t vbussensingA :
    1;
uint32_t vbussensingB :
    1;
uint32_t SOFouten :
    1;
uint32_t reserved_out :
    11;
  }
  b;
} USB_OTG_gpio_data;


/******************************************************************************/

