RT-Thread/rt-thread/bsp/stm32f10x/drivers/usb/inc/otgd_fs_regs.h
typedef union _USB_OTG_hw_cfg1_data
{

  uint32_t d32;
  struct
  {
uint32_t ep_dir0 :
    2;
uint32_t ep_dir1 :
    2;
uint32_t ep_dir2 :
    2;
uint32_t ep_dir3 :
    2;
uint32_t ep_dir4 :
    2;
uint32_t ep_dir5 :
    2;
uint32_t ep_dir6 :
    2;
uint32_t ep_dir7 :
    2;
uint32_t ep_dir8 :
    2;
uint32_t ep_dir9 :
    2;
uint32_t ep_dir10 :
    2;
uint32_t ep_dir11 :
    2;
uint32_t ep_dir12 :
    2;
uint32_t ep_dir13 :
    2;
uint32_t ep_dir14 :
    2;
uint32_t ep_dir15 :
    2;
  }
  b;
} USB_OTG_hw_cfg1_data;

/******************************************************************************/
typedef union _USB_OTG_hw_cfg2_data
{
  uint32_t d32;
  struct
  {
uint32_t op_mode :
    3;
uint32_t architecture :
    2;
uint32_t point2point :
    1;
uint32_t hs_phy_type :
    2;
uint32_t fs_phy_type :
    2;
uint32_t num_dev_ep :
    4;
uint32_t num_host_chan :
    4;
uint32_t perio_ep_supported :
    1;
uint32_t dynamic_fifo :
    1;
uint32_t rx_status_q_depth :
    2;
uint32_t nonperio_tx_q_depth :
    2;
uint32_t host_perio_tx_q_depth :
    2;
uint32_t dev_token_q_depth :
    5;
uint32_t reserved31 :
    1;
  }
  b;
} USB_OTG_hw_cfg2_data;

/******************************************************************************/

typedef union _USB_OTG_hw_cfg3_data
{

  uint32_t d32;
  struct
  {
uint32_t xfer_size_cntr_width :
    4;
uint32_t packet_size_cntr_width :
    3;
uint32_t otg_func :
    1;
uint32_t i2c :
    1;
uint32_t vendor_ctrl_if :
    1;
uint32_t optional_features :
    1;
uint32_t synch_reset_type :
    1;
uint32_t ahb_phy_clock_synch :
    1;
uint32_t reserved15_13 :
    3;
uint32_t dfifo_depth :
    16;
  }
  b;
} USB_OTG_hw_cfg3_data;

/******************************************************************************/

typedef union _USB_OTG_hw_cfg4_data
{
  uint32_t d32;
  struct
  {
uint32_t num_dev_perio_in_ep :
    4;
uint32_t power_optimiz :
    1;
uint32_t min_ahb_freq :
    9;
uint32_t utmi_phy_data_width :
    2;
uint32_t num_dev_mode_ctrl_ep :
    4;
uint32_t iddig_filt_en :
    1;
uint32_t vbus_valid_filt_en :
    1;
uint32_t a_valid_filt_en :
    1;
uint32_t b_valid_filt_en :
    1;
uint32_t session_end_filt_en :
    1;
uint32_t ded_fifo_en :
    1;
uint32_t num_in_eps :
    4;
uint32_t reserved31_30 :
    2;
  }
  b;
} USB_OTG_hw_cfg4_data;

/******************************************************************************/
typedef union _USB_OTG_dev_cfg_data
{

  uint32_t d32;
  struct
  {
uint32_t devspd :
    2;
uint32_t nzstsouthshk :
    1;
uint32_t reserved3 :
    1;
uint32_t devaddr :
    7;
uint32_t perfrint :
    2;
uint32_t reserved13_17 :
    5;
uint32_t epmscnt :
    4;
  }
  b;
} USB_OTG_dev_cfg_data;

/******************************************************************************/

typedef union _USB_OTG_dev_ctl_data
{

  uint32_t d32;
  struct
  {
uint32_t rmtwkupsig :
    1;
uint32_t sftdiscon :
    1;
uint32_t gnpinnaksts :
    1;
uint32_t goutnaksts :
    1;
uint32_t tstctl :
    3;
uint32_t sgnpinnak :
    1;
uint32_t cgnpinnak :
    1;
uint32_t sgoutnak :
    1;
uint32_t cgoutnak :
    1;
uint32_t reserved :
    21;
  }
  b;
} USB_OTG_dev_ctl_data;

/******************************************************************************/
typedef union _USB_OTG_dev_sts_data
{

  uint32_t d32;
  struct
  {
uint32_t suspsts :
    1;
uint32_t enumspd :
    2;
uint32_t errticerr :
    1;
uint32_t reserved4_7:
    4;
uint32_t soffn :
    14;
uint32_t reserved22_31 :
    10;
  }
  b;
} USB_OTG_dev_sts_data;

/******************************************************************************/

typedef union _USB_OTG_dev_in_ep_int_data
{

  uint32_t d32;
  struct
  {
uint32_t xfercompl :
    1;
uint32_t epdisabled :
    1;
uint32_t ahberr :
    1;
uint32_t timeout :
    1;
uint32_t intktxfemp :
    1;
uint32_t intknepmis :
    1;
uint32_t inepnakeff :
    1;
uint32_t emptyintr :
    1;
uint32_t txfifoundrn :
    1;
uint32_t reserved08_31 :
    23;
  }
  b;
} USB_OTG_dev_in_ep_int_data;

/******************************************************************************/

typedef union _USB_OTG_dev_in_ep_int_data  USB_OTG_dev_in_ep_msk_data;
/******************************************************************************/

typedef union _USB_OTG_dev_out_ep_int_data
{

  uint32_t d32;
  struct
  {
uint32_t xfercompl :
    1;
uint32_t epdisabled :
    1;
uint32_t ahberr :
    1;
uint32_t setup :
    1;
uint32_t reserved04_31 :
    28;
  }
  b;
} USB_OTG_dev_out_ep_int_data;

/******************************************************************************/

typedef union _USB_OTG_dev_out_ep_int_data  USB_OTG_dev_out_ep_msk_data;

/******************************************************************************/
typedef union _USB_OTG_dev_all_int_data
{

  uint32_t d32;
  struct
  {
uint32_t in :
    16;
uint32_t out :
    16;
  }
  ep;
  struct
  {
    /** IN Endpoint bits */
uint32_t inep0  :
    1;
uint32_t inep1  :
    1;
uint32_t inep2  :
    1;
uint32_t inep3  :
    1;
uint32_t inep4  :
    1;
uint32_t inep5  :
    1;
uint32_t inep6  :
    1;
uint32_t inep7  :
    1;
uint32_t inep8  :
    1;
uint32_t inep9  :
    1;
uint32_t inep10 :
    1;
uint32_t inep11 :
    1;
uint32_t inep12 :
    1;
uint32_t inep13 :
    1;
uint32_t inep14 :
    1;
uint32_t inep15 :
    1;
    /** OUT Endpoint bits */
uint32_t outep0  :
    1;
uint32_t outep1  :
    1;
uint32_t outep2  :
    1;
uint32_t outep3  :
    1;
uint32_t outep4  :
    1;
uint32_t outep5  :
    1;
uint32_t outep6  :
    1;
uint32_t outep7  :
    1;
uint32_t outep8  :
    1;
uint32_t outep9  :
    1;
uint32_t outep10 :
    1;
uint32_t outep11 :
    1;
uint32_t outep12 :
    1;
uint32_t outep13 :
    1;
uint32_t outep14 :
    1;
uint32_t outep15 :
    1;
  }
  b;
} USB_OTG_dev_all_int_data;

/******************************************************************************/
typedef union _USB_OTG_token_qr1_data
{

  uint32_t d32;
  struct
  {
uint32_t intknwptr :
    5;
uint32_t reserved05_06 :
    2;
uint32_t wrap_bit :
    1;
uint32_t epnums0_5 :
    24;
  }
  b;
} USB_OTG_token_qr1_data;

/******************************************************************************/

typedef union _USB_OTG_dev_thr_ctl_data
{

  uint32_t d32;
  struct
  {
uint32_t non_iso_thr_en :
    1;
uint32_t iso_thr_en :
    1;
uint32_t tx_thr_len :
    9;
uint32_t reserved11_15 :
    5;
uint32_t rx_thr_en :
    1;
uint32_t rx_thr_len :
    9;
uint32_t reserved26_31 :
    6;
  }
  b;
} USB_OTG_dev_thr_ctl_data;

/******************************************************************************/
typedef union _USB_OTG_dev_ep_ctl_data
{

  uint32_t d32;
  struct
  {
uint32_t mps :
    11;
uint32_t nextep :
    4;
uint32_t usbactep :
    1;
uint32_t dpid :
    1;
uint32_t naksts :
    1;
uint32_t eptype :
    2;
uint32_t snp :
    1;
uint32_t stall :
    1;
uint32_t txfnum :
    4;
uint32_t cnak :
    1;
uint32_t snak :
    1;
uint32_t setd0pid :
    1;
uint32_t setd1pid :
    1;
uint32_t epdis :
    1;
uint32_t epena :
    1;
  }
  b;
} USB_OTG_dev_ep_ctl_data;

/******************************************************************************/

