RT-Thread/rt-thread/bsp/stm32f10x/drivers/usb/inc/otgd_fs_regs.h
typedef union _USB_OTG_dev_ep_txfer_siz_data
{

  uint32_t d32;
  struct
  {
uint32_t xfersize :
    19;
uint32_t pktcnt :
    10;
uint32_t mc :
    2;
uint32_t reserved :
    1;
  }
  b;
} USB_OTG_dev_ep_txfer_siz_data;

/******************************************************************************/

typedef union _USB_OTG_dev_ep_txfer_size0_data
{

  uint32_t d32;
  struct
  {
uint32_t xfersize :
    7;
uint32_t reserved7_18 :
    12;
uint32_t pktcnt :
    1;
uint32_t reserved20_28 :
    9;
uint32_t supcnt :
    2;
    uint32_t reserved31;
  }
  b;
} USB_OTG_dev_ep_txfer_size0_data;

/******************************************************************************/
typedef union _USB_OTG_host_cfg_data
{

  uint32_t d32;
  struct
  {
uint32_t fslspclksel :
    2;
uint32_t fslssupp :
    1;
  }
  b;
} USB_OTG_host_cfg_data;

/******************************************************************************/

typedef union _USB_OTG_Host_frm_intrvl_data
{
  uint32_t d32;
  struct
  {
uint32_t frint :
    16;
uint32_t reserved :
    16;
  }
  b;
} USB_OTG_Host_frm_intrvl_data;

/******************************************************************************/
#define HFNUM_MAX_FRNUM 0x3FFF
typedef union _USB_OTG_host_frm_nbr_data
{

  uint32_t d32;
  struct
  {
uint32_t frnum :
    16;
uint32_t frrem :
    16;
  }
  b;
} USB_OTG_host_frm_nbr_data;

/******************************************************************************/

typedef union _USB_OTG_host_perio_tx_sts_data
{

  uint32_t d32;
  struct
  {
uint32_t ptxfspcavail :
    16;
uint32_t ptxqspcavail :
    8;
uint32_t ptxqtop_terminate :
    1;
uint32_t ptxqtop_token :
    2;
uint32_t ptxqtop_chnum :
    4;
uint32_t ptxqtop_odd :
    1;
  }
  b;
} USB_OTG_host_perio_tx_sts_data;

/******************************************************************************/
typedef union _USB_OTG_hprt0_data
{
  uint32_t d32;
  struct
  {
uint32_t prtconnsts :
    1;
uint32_t prtconndet :
    1;
uint32_t prtena :
    1;
uint32_t prtenchng :
    1;
uint32_t prtovrcurract :
    1;
uint32_t prtovrcurrchng :
    1;
uint32_t prtres :
    1;
uint32_t prtsusp :
    1;
uint32_t prtrst :
    1;
uint32_t reserved9 :
    1;
uint32_t prtlnsts :
    2;
uint32_t prtpwr :
    1;
uint32_t prttstctl :
    4;
uint32_t prtspd :
    2;
uint32_t reserved19_31 :
    13;
  }
  b;
} USB_OTG_hprt0_data;

/******************************************************************************/

typedef union _USB_OTG_host_all_int_data
{
  uint32_t d32;
  struct
  {
uint32_t ch0 :
    1;
uint32_t ch1 :
    1;
uint32_t ch2 :
    1;
uint32_t ch3 :
    1;
uint32_t ch4 :
    1;
uint32_t ch5 :
    1;
uint32_t ch6 :
    1;
uint32_t ch7 :
    1;
uint32_t ch8 :
    1;
uint32_t ch9 :
    1;
uint32_t ch10 :
    1;
uint32_t ch11 :
    1;
uint32_t ch12 :
    1;
uint32_t ch13 :
    1;
uint32_t ch14 :
    1;
uint32_t ch15 :
    1;
uint32_t reserved :
    16;
  }
  b;

  struct
  {
uint32_t chint :
    16;
uint32_t reserved :
    16;
  }
  b2;
} USB_OTG_host_all_int_data;


/******************************************************************************/

typedef union _USB_OTG_host_all_int_msk_data
{
  uint32_t d32;
  struct
  {
uint32_t ch0 :
    1;
uint32_t ch1 :
    1;
uint32_t ch2 :
    1;
uint32_t ch3 :
    1;
uint32_t ch4 :
    1;
uint32_t ch5 :
    1;
uint32_t ch6 :
    1;
uint32_t ch7 :
    1;
uint32_t ch8 :
    1;
uint32_t ch9 :
    1;
uint32_t ch10 :
    1;
uint32_t ch11 :
    1;
uint32_t ch12 :
    1;
uint32_t ch13 :
    1;
uint32_t ch14 :
    1;
uint32_t ch15 :
    1;
uint32_t reserved :
    16;
  }
  b;

  struct
  {
uint32_t chint :
    16;
uint32_t reserved :
    16;
  }
  b2;
} USB_OTG_host_all_int_msk_data;

/******************************************************************************/

typedef union _USB_OTG_hc_char_data
{

  uint32_t d32;
  struct
  {
uint32_t mps :
    11;
uint32_t epnum :
    4;
uint32_t epdir :
    1;
uint32_t reserved :
    1;
uint32_t lspddev :
    1;
uint32_t eptype :
    2;
uint32_t multicnt :
    2;
uint32_t devaddr :
    7;
uint32_t oddfrm :
    1;
uint32_t chdis :
    1;
uint32_t chen :
    1;
  }
  b;
} USB_OTG_hc_char_data;

/******************************************************************************/
typedef union _USB_OTG_hc_splt_data
{

  uint32_t d32;
  struct
  {
uint32_t prtaddr :
    7;
uint32_t hubaddr :
    7;
uint32_t xactpos :
    2;
uint32_t compsplt :
    1;
uint32_t reserved :
    14;
uint32_t spltena :
    1;
  }
  b;
} USB_OTG_hc_splt_data;

/******************************************************************************/

typedef union _USB_OTG_hc_int_data
{
  uint32_t d32;
  struct
  {
uint32_t xfercomp :
    1;
uint32_t chhltd :
    1;
uint32_t ahberr :
    1;
uint32_t stall :
    1;
uint32_t nak :
    1;
uint32_t ack :
    1;
uint32_t nyet :
    1;
uint32_t xacterr :
    1;
uint32_t bblerr :
    1;
uint32_t frmovrun :
    1;
uint32_t datatglerr :
    1;
uint32_t reserved :
    21;
  }
  b;
} USB_OTG_hc_int_data;

/******************************************************************************/


typedef union _USB_OTG_hc_txfer_siz_data
{

  uint32_t d32;
  struct
  {
uint32_t xfersize :
    19;
uint32_t pktcnt :
    10;
uint32_t pid :
    2;
uint32_t dopng :
    1;
  }
  b;
} USB_OTG_hc_txfer_siz_data;

/******************************************************************************/

typedef union _USB_OTG_hc_int_msk_data
{

  uint32_t d32;
  struct
  {
uint32_t xfercompl :
    1;
uint32_t chhltd :
    1;
uint32_t ahberr :
    1;
uint32_t stall :
    1;
uint32_t nak :
    1;
uint32_t ack :
    1;
uint32_t nyet :
    1;
uint32_t xacterr :
    1;
uint32_t bblerr :
    1;
uint32_t frmovrun :
    1;
uint32_t datatglerr :
    1;
uint32_t reserved :
    21;
  }
  b;
} USB_OTG_hc_int_msk_data;

/******************************************************************************/

typedef union _USB_OTG_host_pcgcctl_data
{
  uint32_t d32;
  struct
  {
uint32_t stoppclk :
    1;
uint32_t gatehclk :
    1;
uint32_t pwrclmp :
    1;
uint32_t rstpdwnmodule :
    1;
uint32_t physuspended :
    1;
uint32_t reserved :
    27;
  }
  b;
} USB_OTG_host_pcgcctl_data;

#endif /* STM32F10X_CL */

/******************* (C) COPYRIGHT 2009 STMicroelectronics *****END OF FILE****/

#endif
